NYCapable/app/controllers/routes_controller.rb

SELECT "stations".* FROM "stations"
SELECT  "stations".* FROM "stations"  ORDER BY "stations"."distance_to" ASC LIMIT 5
UPDATE "routes" SET "service_status" = $1, "service_status_note" = $2, "updated_at" = $3 WHERE "routes"."id" = $4  [["service_status", "GOOD SERVICE"], ["service_status_note", ""], ["updated_at", "2015-07-20 01:34:56.951877"], ["id", 21]]
---
  def index
    # What if....
    #
    # @user_location = UserLocation.new(params["variable"])
    # @user_location.to_geokit_latlong
    #
    #

    @user_location = params["variable"].split(",").map! {|num| num.to_f }
    @user_location_object = Geokit::LatLng.new(@user_location[0],@user_location[1])

    stations = Station.all
    stations.each do |station|
      # What if a station knew how to lat_longify itself?
      # and knew how to respond to station.distance(@user_location_object)
      @station_location = Geokit::LatLng.new(station.latitude,station.longitude)
      station.distance_to = @user_location_object.distance_to(@station_location)
    end

    @closest_stations = Station.order(distance_to: :asc).limit(5)
    # Again, the bad naming thing
    @route = Route.all.order("route_id ASC")
    Route.update_status