NYCapable/app/views/routes/index.html.erb

SELECT "routes"."route_short_name" FROM "routes" INNER JOIN "route_stations" ON "routes"."id" = "route_stations"."route_id" WHERE "route_stations"."station_id" = $1  [["station_id", 21]]
---

    <h2><%= @closest_stations[0].routes.pluck(:route_short_name).join(" , ")%> || <%= @closest_stations[0].name %>  || <%= (@closest_stations[0].distance_to).round(2) %> miles</h2>